chtMultiregionFoam/nNonOrtho_expt_case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    maxY
    {
        type            wall;
        inGroups        1(wall);
        nFaces          900;
        startFace       418650;
    }
    minX
    {
        type            wall;
        inGroups        1(wall);
        nFaces          900;
        startFace       419550;
    }
    maxX
    {
        type            wall;
        inGroups        1(wall);
        nFaces          900;
        startFace       420450;
    }
    minY
    {
        type            wall;
        inGroups        1(wall);
        nFaces          900;
        startFace       421350;
    }
    minZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          900;
        startFace       422250;
    }
    maxZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          900;
        startFace       423150;
    }
)

// ************************************************************************* //
